[
    {
        "timerMinutesOffset": 15,
        "timerMinutes": 90,
        "random": true,
        "commands": [
            {
                "name": "!therun",
                "aliases": ["!therungg"],
                "autoPostGameWhitelist": ["Luigi's Mansion"],
                "responses": [
                    "Interested in seeing extra details and statistics about my splits as I speedrun? Check my profile on TheRun.gg, and click the live button to see realtime updates on my current run! https://therun.gg/live/Elite_Spud"
                ]
            },
            {
                "name": "!blind_recurring",
                "aliases": [],
                "autoPostIfTitleContainsAny": ["!blind"],
                "responses": [
                    "This is a blind playthrough, which means that I know nothing about this game want to keep it that way. Do not tell me how to play the game. Do not spoil. Do not fake spoil. Do not hint, backseat, advise, guide, remind, or warn me in any way, please. Consider all questions to be rhetorical. Revel in my ignorance, and enjoy my suffering. https://gist.github.com/elite-spud/cd03e5250cae33d2cd808acb6cb63327"
                ]
            },
            {
                "name": "!spoilerdiscord_recurring",
                "aliases": ["!spoilerdiscord"],
                "autoPostIfTitleContainsAny": ["!blind"],
                "responses": [
                    "Wanna talk spoilers without posting directly in twitch chat? I've got a dedicated channel for spoiler-y discussion in the Discord server! Consider telling the folks in here that you'll be talking there so that others can join in on the conversation! https://discord.gg/f4bhKYxPy8"
                ]
            },
            {
                "name": "!crowdcontrol",
                "aliases": ["!cc", "!CC", "!CrowdControl"],
                "autoPostIfTitleContainsAny": ["!cc"],
                "responses": [
                    "Crowd Control provides a way for viewers to interact with the game I'm playing on stream! Whether you choose to help, hinder, or just make things look a bit silly while I play, the power is in *your* hands. Everyone gets 50 free coins that they can use to fuel these effects, but you can also exchange channel points (or money) to earn more! Visit https://interact.crowdcontrol.live/#/twitch/47243772 to spend coins, or try using the integrated twitch extension (it even works on mobile)!"
                ]
            },
            {
                "name": "!crowdcontrolchallenge",
                "aliases": ["!ccc", "!challenge", "!ccmax"],
                "expiresAt": "2024-10-01T02:00:00",
                "autoPostIfTitleContainsAny": ["!cc"],
                "responses": [
                    "Welcome to our 2nd annual Luigi's Mansion Crowd Control Max% playthrough! If you're unfamiliar with what the heck is going on here, you can type !cc or !max% to learn more, but in a nutshell, I'm trying to collect as much in-game money as possible while chat tries to thwart those plans through the power of real-world money. For every 500,000G that I'm missing by the end of my playthrough, I'll send an additional $5 to Breakthrough T1D https://tiltify.com/@elite-spud/game-over-t1d-2024!"
                ]
            },
            {
                "name": "!incentive",
                "aliases": ["!incentives", "!goals", "!subgoals"],
                "autoPostIfTitleContainsAny": ["!incentive", "!incentives"],
                "responses": [
                    "Current subgoal incentives: https://docs.google.com/spreadsheets/d/1dNi-OkDok6SH8VrN1s23l-9BIuekwBgfdXsu-SqIIMY (see the other sub-sheets for active bidwars and channel point requests)"
                ]
            },
            {
                "name": "!attractmode",
                "aliases": ["!la", "!ladyarcaders"],
                "expiresAt": "2024-05-06T02:00:00",
                "autoPostIfTitleContainsAny": ["!attractmode"],
                "responses": [
                    "I'll be participating in the Lady Arcaders' Attract Mode once again on May 5th at 1:00 CST, by playing some F-Zero GX. The plan is to speedrun through the story mode on Very Hard difficulty, but if I finish that quickly, then I might have time for some other stuff!"
                ]
            },
            {
                "name": "!gdqhotfix",
                "aliases": ["!hotfix"],
                "expiresAt": "2024-06-28T02:00:00",
                "autoPostIfTitleContainsAny": ["!hotfix", "!gdqhotfix"],
                "responses": [
                    "I'll be appearing on @Mr_Shasta's GDQ Hotfix show, Do All the Things!, on June 27th at 7:00 PM EST where I'll playing some Luigi's Mansion 100% [PAL] in a race with @KaiiRunz!"
                ]
            },
            {
                "name": "!gdq",
                "expiresAt": "2024-10-12T02:00:00",
                "autoPostIfTitleContainsAny": ["!gdq", "GDQ"],
                "responses": [
                    "I'll be appearing on GDQ's Disaster Relief Done Quick marathon this Friday, playing Luigi's Mansion Any% (No OoB) [PAL]! Check out the full schedule here: https://gamesdonequick.com/schedule/53"
                ]
            },
            {
                "name": "!bbbbq",
                "aliases": ["!bbq"],
                "expiresAt": "2024-07-01T02:00:00",
                "autoPostIfTitleContainsAny": ["!bbq", "!bbbbq"],
                "responses": [
                    "I'll be participating in the Binary Breakers' Summer BBQ on Saturday! @enbyzee will be joining me on comms while I play through Luigi's Mansion Any% (No OoB) [PAL] https://horaro.org/bbsbbq/2024?key=BYOBBQ"
                ]
            },
            {
                "name": "!completithon",
                "expiresAt": "2024-08-18T02:00:00",
                "autoPostIfTitleContainsAny": ["!completithon"],
                "responses": [
                    "I'll be running Luigi's Mansion Max% as part of Completithon 2024 on Sunday, August 18th at 8:30 PM EDT! https://horaro.org/completithon2024/schedule As far as I know, this is the first Max% showcase in several years, so it's certain to be a special run!"
                ]
            },
            {
                "name": "!charity",
                "expiresAt": "2024-10-01T02:00:00",
                "aliases": ["!donate", "!fundraiser", "!fundraising", "!gameovert1d", "!tiltify", "!campaign", "!charitycampaign"],
                "autoPostIfTitleContainsAny": ["jdrf", "fundraiser", "fundraising", "!gameovert1d", "!tiltify", "!campaign", "!charitycampaign", "!donate"],
                "responses": [
                    "Through the end of September, I'll be raising money to support Breakthrough T1D (formerly JDRF), the world's largest nonprofit funder of Type 1 Diabetes research. On Sep 29th, the fundraising campaign will culminate in a Luigi's Mansion Crowd Control stream, which you can facilitate by donating to BT1D through the CC interface! https://interact.crowdcontrol.live/#/twitch/47243772/coins. Any donations made prior to the 29th will still earn you coins that can be used to fuel the chaos!            If you'd prefer to donate directly without any Crowd Control involvement, please use the main campaign link here: https://tiltify.com/@elite-spud/game-over-t1d-2024"
                ]
            },
            {
                "name": "!bt1d",
                "aliases": ["!BT1D"],
                "expiresAt": "2024-10-01T02:00:00",
                "autoPostIfTitleContainsAny": ["jdrf", "fundraiser", "fundraising", "bt1d", "!gameovert1d", "!tiltify", "!campaign", "!charitycampaign", "!donate"],
                "responses": [
                    "Breakthrough T1D is the world’s largest nonprofit funder of type 1 diabetes (T1D) research. With your support, we hope to find cures for T1D and improve the lives of those affected by it: https://tiltify.com/@elite-spud/game-over-t1d-2024"
                ]
            },
            {
                "name": "!chickennugget%",
                "expiresAt": "2024-10-01T02:00:00",
                "autoPostIfTitleContainsAny": ["!nugget%", "!Nugget%", "!ChickenNugget%"],
                "responses": [
                    "This playthrough fulfills an incentive that was met by my community! I'll be playing through what is essentially Max%, only I'll be eating 1 chicken nugget after each Boo that I capture. Yes, Boolossus counts as 15 nuggets. I am aware that this is a bad idea, because I am the one who came up with it."
                ]
            },
            {
                "name": "!runningthroughwonderland",
                "aliases": ["!rtw", "!wonderland"],
                "expiresAt": "2024-10-12T02:00:00",
                "autoPostIfTitleContainsAny": ["!runningthroughwonderland", "!wonderland", "!showcase", "!rtw"],
                "responses": [
                    "On Saturday, October 19th at 8:00 PM EST, I'll be running Luigi's Mansion 100% as part of a charity marathon in support of AliceAtWonderlandGames! LuckyOwl360 will be joining me on comms, and we'll have a category upgrade incentive to potentially have me showcase PAL 100% for an even more exciting run! Check out the full schedule here: https://horaro.org/rtw/schedule"
                ]
            },
            {
                "name": "!lickython",
                "expiresAt": "2024-10-28T02:00:00",
                "autoPostIfTitleContainsAny": ["!lickython"],
                "responses": [
                    "On Sunday, October 27th I'll be running Luigi's Mansion AND F-Zero GX as part of the charity marathon, LickyThon! This is the 4th iteration of this marathon, and it'll be benefitting the Children's Hospital of Philadelphia. It's also an in-person event, so I'll be sitting on a couch with a bunch of other cool people while I run both games! Check out the schedule here: https://horaro.org/lickython4/schedule and tune into the stream over at https://www.twitch.tv/lickarcade"
                ]
            },
            {
                "name": "!pacelta",
                "expiresAt": "2024-11-05T02:00:00",
                "autoPostIfTitleContainsAny": ["!lta", "!LTA", "!pace", "!PACE", "!PACELTA", "!pacelta"],
                "aliases": ["!lta", "!LTA", "!pace", "!PACE", "!PACELTA", "!pacelta"],
                "responses": [
                    "On Monday, November 4th, 7 Luigi's Mansion runners will participate in an in-person Live Time Attack competition at PACE's Fall 2024 event. I'll be assisting with comms for this event, which will last for 9 straight hours from 11 AM - 8PM Eastern time. Check out the full schedule to see the runners involved as well as other games being featured! https://horaro.org/pace24f/schedule"
                ]
            }
        ]
    },
    {
        "timerMinutesOffset": 75,
        "timerMinutes": 90,
        "random": true,
        "commands": [
            {
                "name": "!response",
                "responses": [
                    "Ask a question but didn't get an answer? Feel free to ask again in a few minutes with an @ if I don't respond the first time!",
                    "I often get tunnel vision when playing video games on stream, so it's tough to keep up with chat sometimes. If your question isn't answered, please ask again after a little while!",
                    "Sorry if I miss any of your questions! I promise it's not intentional. Please @ me and ask again if I don't get around to your message the first time.",
                    "I'm easily distracted, and often go on tangents while in the middle of talking about things. If I get sidetracked while talking about something you found interesting, please feel free to bring it up again so I can finish sharing my thoughts!",
                    "I sometimes stream games which require a lot of focus to play, so it's not uncommon for me to miss important chat messages while I'm in the zone. If it seems like I missed your message, or didn't address anything to your satisfaction, please ask me to clarify or elaborate further and I'll be more than happy to oblige."
                ]
            },
            {
                "name": "!hydrate",
                "aliases": ["!meds", "!vitamins"],
                "responses": [
                    "Friendly reminder to take a sip of water, stretch your legs, take any meds or vitamins you need, and grab a snack if you're hungry."
                ]
            }
        ]
    },
    {
        "timerMinutesOffset": 90,
        "timerMinutes": 90,
        "random": true,
        "commands": [
        ]
    },
    {
        "timerMinutesOffset": 45,
        "timerMinutes": 90,
        "random": true,
        "commands": [
            {
                "name": "!youtube",
                "aliases": ["!vods", "!vod"],
                "responses": [
                    "VODs get posted to Youtube (in higher quality than streams!): https://www.youtube.com/@elite_spud",
                    "Blind playthroughs and other interesting streams get uploaded to YouTube here: https://www.youtube.com/@elite_spud",
                    "Miss a playthrough you really wanted to catch? I archive my streams locally at 1440p and post them on YouTube! https://www.youtube.com/@elite_spud"
                ]
            },
            {
                "name": "!discord",
                "responses": [
                    "We have a Discord server! Join in and be a part of the community offstream! https://discord.gg/f4bhKYxPy8",
                    "Want consistent notifications when the stream is live? Join the Discord server and request a role to always get pinged! https://discord.gg/f4bhKYxPy8",
                    "Enjoy using my sub emotes? You can link your Twitch account with Discord to get access to them on other servers if you're a subscriber. No Nitro required! https://discord.gg/f4bhKYxPy8",
                    "Like seeing Loki and the other kitties on stream? You can see more of them and other folks' animals in the community Discord! https://discord.gg/f4bhKYxPy8",
                    "Wanna talk about music you love or discovered recently? We've got a Discord channel for that! https://discord.gg/f4bhKYxPy8",
                    "Do you like to cook or consider yourself a food-lover? See what the community's been dining on recently in our Discord server: https://discord.gg/f4bhKYxPy8",
                    "Interested in talking about all the intricacies that go into streaming? Hear my thoughts and others' in our dedicated channels for stream/tech talk in the Discord https://discord.gg/f4bhKYxPy8"
                ]
            },
            {
                "name": "!music",
                "aliases": ["!rateyourmusic", "!musicratings", "!lastfm", "!songs"],
                "responses": [
                    "I collect music CDs and keep track of what I listen to as a hobby. You can judge my music taste here https://rateyourmusic.com/~elite_spud and here https://www.last.fm/user/elite_spud",
                    "I've been building up a small collection of music CDs for a few years. See what I've got and what I've been listening to https://rateyourmusic.com/~elite_spud & https://www.last.fm/user/elite_spud",
                    "In my spare time, I curate a small music CD collection, mostly focused around heavy, progressive, dark, and ambient genres. Check out what I have at https://rateyourmusic.com/~elite_spud + https://www.last.fm/user/elite_spud and feel free to shoot me a recommendation (any genre) if you've got one!"
                ]
            },
            {
                "name": "!instagram",
                "aliases": ["!cats", "!insta", "!ig"],
                "responses": [
                    "I have an instagram where I post pictures of my cats and also cool places I travel to https://www.instagram.com/elite.spud/",
                    "Hey, wanna see some cute cats? https://www.instagram.com/elite.spud/",
                    "I might not consider myself much of a photographer, but I do like to stop and take pictures of flowers and other beautiful things I see from day to day https://www.instagram.com/elite.spud/"
                ]
            },
            {
                "name": "!av",
                "aliases": ["!diagram"],
                "responses": [
                    "Wanna know how many wires are in my AV setup? Or what it takes to play GameBoy games on a PC monitor? Check out the diagram I made to keep up with it all, and don't be afraid to ask me questions about any specific components: https://gist.github.com/elite-spud/6f82f3da9d586df553757fa134278845",
                    "Wondering what kind of hardware I use to stream/play console games? Take a look at my layout diagram to see how everything hooks together: https://gist.github.com/elite-spud/6f82f3da9d586df553757fa134278845. Don't be afraid to ask questions about how everything works!"
                ]
            },
            {
                "name": "!hardware",
                "aliases": ["!pc", "!equipment"],
                "responses": [
                    "You can find a list of all the parts in my PC / stream setup here: https://pcpartpicker.com/user/elite_spud/saved/VyqDzy"
                ]
            },
            {
                "name": "!pendinggames",
                "aliases": ["!streamgames", "!games"],
                "responses": [
                    "I maintain a list of all the games I've streamed (and would like to stream) here: https://docs.google.com/spreadsheets/d/1JsdDfmdjaL3d-oGsuq38z_jhrvkhePF1LLz4W1dpzI4/edit?usp=sharing and keep a tier list of my blind playthroughs here: https://gist.github.com/elite-spud/760e0628d58b36cdb8e4477dd647e370"
                ]
            },
            {
                "name": "!github",
                "aliases": ["!bot", "!chatbot", "!code", "!sourcecode"],
                "responses": [
                    "I (Spud) wrote this chatbot myself because I'm a big nerd. If you fancy yourself a nerd too, you can peruse the source code on GitHub here: https://github.com/elite-spud/spudbot",
                    "This chatbot is © Spud Inc., which maintains an open policy of showcasing all the programming mistakes of the chatbot author for all to see here: https://github.com/elite-spud/spudbot",
                    "I'm a software engineer by day, and this chatbot is actually one of my side-projects! If you want to see how it works, you can find all the source code here: https://github.com/elite-spud/spudbot",
                    "I'm not a potato, I'm a bot! Get a peek at my source code here: https://github.com/elite-spud/spudbot"
                ]
            },
            {
                "name": "!glitchwave",
                "aliases": ["!gameratings"],
                "responses": [
                    "I took the time to catalog and rate all the games I've played over the years. Take a peek at my favorites and not-so-favorites here: https://glitchwave.com/user/elite_spud/",
                    "Curious if I've played your favorite game before, and/or what my opinions about it are? Look no further: https://glitchwave.com/user/elite_spud/",
                    "Got a favorite game? Me too: https://glitchwave.com/user/elite_spud/",
                    "What's the worst game I've ever played? The answer may surprise you: https://glitchwave.com/user/elite_spud/"
                ]
            },
            {
                "name": "!twitchnotifications",
                "responses": [
                    "Twitch notifications are sometimes inconsistent, but I try to include special little messages in my going live pings for each stream, so turn 'em on if you wanna be implicated in my goofin' around! You can manage your notifications in detail here: https://www.twitch.tv/settings/notifications"
                ]
            },
            {
                "name": "!streamteam",
                "aliases": ["!binarybreakers", "!bb"],
                "responses": [
                    "I'm part of a stream team on Twitch! If you're looking for some amazing nonbinary streamers to follow, check out the Binary Breakers! https://www.twitch.tv/team/binarybreakers"
                ]
            },
            {
                "name": "!gamesuggestions",
                "aliases": ["!gamesuggestion", "!recommendation", "!request", "!requests", "!GameRequest", "!GameRequests", "!gamerequest", "!gamerequests", "!ViewerRequest", "!viewerrequest", "!viewerRequest", "!ViewerRequests"],
                "strict": true,
                "responses": [
                    "Channel points can be used to request games that you want me to play on stream! Submit your favorite title, challenge me with something super difficult, get weird/goofy with it, or help fund someone else's suggestion! Almost anything is fair game so long as I have the means to play it! (e.g. no VR, foreign visual novels, etc.) Check out the spreadsheet to see everyone's requests! https://docs.google.com/spreadsheets/d/1dNi-OkDok6SH8VrN1s23l-9BIuekwBgfdXsu-SqIIMY/edit?gid=384782784"
                ]
            },
            {
                "name": "!bidwar",
                "strict": true,
                "aliases": ["!incentive", "!incentives", "!goals"],
                "responses": [
                    "Have you cheered bits on the channel before? You might have a balance in the bidwar bank! The current bidwar will be active until the end of 2024, so make sure to use your points to vote on your favorite option. Type '!bidwar contribute' to get started! https://docs.google.com/spreadsheets/d/1dNi-OkDok6SH8VrN1s23l-9BIuekwBgfdXsu-SqIIMY/edit?gid=877321766"
                ]
            }
        ]
    },
    {
        "commands": [
            {
                "name": "!rules",
                "aliases": ["!chatrules"],
                "responses": [
                    "Chat Rules: • No bigotry, harassment, or intolerance allowed. Respect other folks or be banned • Don't spoil anything • Don't tell me how to play the game • Don't trauma dump. I want to cultivate a safe and positive space in my chat • Keep any political / religious discussions civil and infrequent • Stream is generally PG to PG-13. I prefer not to swear for my own reasons, but don't really care if you do (within reason) • No shortened hyperlinks • No self-promotion spam • Don't be a dingus"
                ]
            },
            {
                "name": "!pronouns",
                "responses": [
                    "Spud's pronouns are They/She. See other chatters' pronouns and set your own here (if you'd like others to know them): https://pronouns.alejo.io/"
                ]
            },
            {
                "name": "!trans",
                "responses": [
                    "Non-binary transfeminine. They/She pronouns. Sapphic. Hormone therapy since Dec 2020. Bottom surgery in 2022."
                ]
            },
              {
                "name": "!nonbinary",
                "aliases": ["!nb", "!non-binary", "!trans", "!gender"],
                "responses": [
                    "Hi! I'm non-binary, which is a term that means a lot of different things to a lot of people. For me, it means that I identify more strongly with the general concept of being a human person than anything else. Despite presenting more femininely, I prefer to think of myself in a more neutral way, which is why I enjoy being addressed with both they/them & she/her pronouns, as it reinforces how I see myself! If you have any other questions about what it's like to be NB, please don't hesitate to ask!"
                ]
            },
            {
                "name": "!gay",
                "responses": [
                    "As heck https://www.instagram.com/p/CvIRzIjPQY7"
                ]
            },
            {
                "name": "!emotes",
                "aliases": ["!emotelist", "!ffz", "!bttv"],
                "responses": [
                    "Sub emotes: https://www.twitchemotes.com/channels/47243772 FFZ Emotes: https://www.frankerfacez.com/channel/elite_spud BTTV Emotes: https://betterttv.com/users/5ca587c9fc7c0646cddcd7a4"
                ]
            },
            {
                "name": "!foo",
                "responses": [
                    "bar"
                ]
            },
            {
                "name": "!tomato",
                "responses": [
                    "tomahto"
                ]
            },
            {
                "name": "!potato",
                "responses": [
                    "potahto"
                ]
            },
            {
                "name": "!lurk",
                "responses": [
                    "jrLurk"
                ]
            },
            {
                "name": "!blind",
                "aliases": [],
                "responses": [
                    "Blind means that I know nothing about the game I'm playing and want to keep it that way."
                ]
            },
            {
                "name": "!rhetorical",
                "aliases": ["!blind", "!spoiler", "!spoilers", "spoils", "!spoil", "!hint", "!hints", "!nohints", "!help", "!mints", "!nomints"],
                "responses": [
                    "Do not tell me how to play the game. Do not spoil. Do not fake spoil. Do not hint, backseat, advise, guide, remind, or warn me in any way, please. Consider all questions to be rhetorical. If I am wrong about something, you don't have to be right. Revel in my ignorance, and enjoy my suffering."
                ]
            },
            {
                "name": "!backseating",
                "aliases": ["!backseat"],
                "responses": [
                    "What is backseating?: https://gist.github.com/elite-spud/cd03e5250cae33d2cd808acb6cb63327"
                ]
            },
            {
                "name": "!commands",
                "responses": [
                    "Available commands include: !commands    (note: list may be incomplete)"
                ]
            },
            {
                "name": "!ta",
                "aliases": ["!totalannihilation", "!totala"],
                "responses": [
                    "To play Total Annihilation on Windows 10, I use a program called DXWND to run the game in a window that tricks the game into thinking it's fullscreen. My method for doing that is detailed here: https://gist.github.com/elite-spud/26cd9a8a4235b3e741941a69ab995abd"
                ]
            },
            {
                "name": "!angie",
                "responses": [
                    "Angie the RNG mouse: https://i.imgur.com/YqBJbJX.jpeg"
                ]
            },
            {
                "name": "!split",
                "aliases": ["!splits"],
                "responses": [
                    "Don't forget to split, ya dingus!"
                ]
            },
            {
                "name": "!captions",
                "aliases": ["!caption"],
                "responses": [
                    "I use OBS-captions-plugin for my on-screen captions as well as the closed-captions sent directly in the Twitch broadcast. Download it here: https://github.com/ratwithacompiler/OBS-captions-plugin/releases"
                ]
            },
            {
                "name": "!franklin",
                "responses": [
                    "https://i.imgur.com/uZtU5PY.png"
                ]
            },
            {
                "name": "!bestwestern",
                "aliases": ["!hotel", "!western"],
                "responses": [
                    "https://i.imgur.com/4FIRGa0.png"
                ]
            },
            {
                "name": "!frostfatales2023",
                "responses": [
                    "I participated in Frost Fatales 2023 by running Luigi's Mansion 100%! Check out the VOD here if you missed it: https://youtu.be/hvXPqOkV9xU"
                ]
            },
            {
                "name": "!frightfatales",
                "responses": [
                    "I'm participating in Frame Fatales' Halloween-themed event, Fright Fatales, this year! I'll be playing Luigi's Mansion Any% (No OoB) this Saturday at 1:15 CST. Going for a sub-hour run and maybe even a surprise PB!"
                ]
            },
            {
                "name": "!TDoV",
                "aliases": ["!transdayofvisibility", "!tdov"],
                "responses": [
                    "March 31 is Transgender Day of Visibility! As a trans person who's also observable in the visible spectrum of electromagnetic radiation, I'm here playing games and being proud about myself in the most public way I can. Not every trans person has the same privilege to make themselves visible, though, so I think it's important to stand in solidarity with those who aren't yet able. We exist, we are strong, and our voices will be heard."
                ]
            },
            {
                "name": "!corathon",
                "aliases": ["!marathon"],
                "responses": [
                    "At 12:00 CST on April 8, I'll be taking part in Corathon, an upcoming speedrunning marathon, by showcasing Luigi's Mansion 100%! This event will benefit Cora, a friend-of-a-friend who's trying to move out of Texas to a more trans-friendly part of the US, a reality I'm all too familiar with. There's a lot of amazing games and amazing people featured in this marathon, so be sure to mark your calendars! To see the full schedule, please visit https://horaro.org/corathon/schedule."
                ]
            },
            {
                "name": "!max%",
                "aliases": ["!maxpercent", "!Max%", "!MaxPercent"],
                "responses": [
                    "Max% is: All Toads, All Gold Frames, & All Money (142,390,000G in NTSC, 186,440,000G in PAL). It is arguably the hardest speedrun category in the game."
                ]
            },
            {
                "name": "!happy",
                "strict": true,
                "responses": [
                    "pride!"
                ]
            },
            {
                "name": "!Happy",
                "strict": true,
                "responses": [
                    "Pride!"
                ]
            },
            {
                "name": "!HAPPY",
                "strict": true,
                "responses": [
                    "PRIDE!"
                ]
            },
            {
                "name": "!lmtournament",
                "aliases": ["!tournament, !tourney", "!Tournament"],
                "responses": [
                    "I'm participating in the annual Luigi's Mansion Any% No OoB tournament this year as both a runner and a commentator! Check out the bracket https://challonge.com/LMTournament2024 and the schedule https://schedule.speedgaming.org/lm/ to keep up with the event!"
                ]
            },
            {
                "name": "!fc",
                "aliases": ["!friendcode"],
                "responses": [
                    "SW-4503-0355-0916 • Please let me know if you send me a friend request so I can accept it!"
                ]
            },
            {
                "name": "!pb",
                "aliases": ["!personalbest"],
                "responses": [
                    "Luigi's Mansion - Any% (No OoB): 58:41 - 100%: 1:14:43 - Max%: 3:01:05 - PAL 100%: 1:30:45"
                ]
            },
            {
                "name": "!baby",
                "aliases": ["!bebe"],
                "responses": [
                    "We recently welcomed our new baby! Her name is Lilah and she's quite the handful right now, so expect the stream schedule to be a little sporadic for a while!"
                ]
            },
            {
                "name": "!keys",
                "responses": [
                    "On the wall behind me, you can see 3D printed replicas of the keys from Luigi's Mansion! The person who made them has a store on Etsy where they sell all sorts of Mario and video game related replicas https://www.etsy.com/listing/1388972794/luigis-mansion-key"
                ]
            },
            {
                "name": "!ladyarcaders",
                "aliases": ["!la"],
                "responses": [
                    "Lady Arcaders is an all-women's gaming collective that organizes weekly showcases by members of the community as well as larger charity events throughout the year. If you're a woman in gaming, whether it be casual, speedrunning, or development, please consider joining in! https://ladyarcaders.com/"
                ]
            },
            {
                "name": "!binarybreakers",
                "aliases": ["!bb"],
                "responses": [
                    "The Binary Breakers are a community of speedrunners who are between, outside, and beyond the gender binary. If that sounds like a space you'd like to be a part of, please don't hesitate to reach out about joining! https://binarybreakersspeedrunning.carrd.co/"
                ]
            },
            {
                "name": "!laraidtrain",
                "responses": [
                    "The Lady Arcaders are celebrating their 2 year anniversary, so the collective has organized a massive raid train event to mark the occasion! https://ladyarcaders.com/raid-train For a little more than 2 days, 25 streamers will take their viewers on a scenic tour through the LA community, and my channel is the first stop! I'm hoping to get this engine up to speed before I pass things off to @EikoTheBlue 4 hours in, so I hope you'll stick around! nevVERS"
                ]
            },
            {
                "name": "!cutscenes",
                "responses": [
                    "\"Why are you watching the cutscenes? I thought this was a speedrun! You've already seen them before!\" - Because I wanna lol"
                ]
            },
            {
                "name": "!dvt",
                "aliases": ["!clot", "!bloodclot"],
                "responses": [
                    "In 2022, I developed a substantial deep vein thrombosis (blood clot) in my left leg following a major surgery. Because I suffered significant vascular scarring from that clot, I'll forever be at high risk of developing another one, which means that I need to take low-dose blood thinners for the rest of my life to reduce the chances of that happening. Staying active also helps though, so I try to take regular breaks during streaming to walk around and stretch; I encourage you all to do the same!"
                ]
            },
            {
                "name": "!fulltime",
                "aliases": ["!hobby"],
                "responses": [
                    "Streaming as a Job vs. Hobby: https://gist.github.com/elite-spud/ef6bc36628f342addab7cba1373ac3b7"
                ]
            },
            {
                "name": "!earnings",
                "aliases": ["!expenses", "!income", "!profit"],
                "responses": [
                    "My stream income / expenses: https://docs.google.com/spreadsheets/d/1kp56JNRRDxzYAIcYfTqVBWh1riNaE6dwDnrdX_8Gd2M/edit?usp=sharing"
                ]
            },
            {
                "name": "!posters",
                "aliases": ["!poster"],
                "responses": [
                    "My F-Zero posters in the background were designed by Ivan García. I own Displate versions of his designs https://displate.com/ivngrcia, but they are also available through Redbubble https://www.redbubble.com/people/ivngrcia/shop."
                ]
            },
            {
                "name": "!GO",
                "responses": [
                    "FAST"
                ]
            },
            {
                "name": "!autosplitter",
                "responses": [
                    "I use Toufool's Autosplitter https://github.com/Toufool/AutoSplit to control LiveSplit by comparing my video capture feed against a set of reference frames. Because I made my own images for F-Zero GX, they're unlikely to work for everyone else out-of-the-box due to the specific way I capture my game. DM me if you want help setting it up, yourself, though!"
                ]
            },
            {
                "name": "!wheeloffast",
                "aliases": ["!wheel"],
                "responses": [
                    "Wanna spin the wheel of fast yourself? Try it here! https://wheelofnames.com/7xx-ect. The cups wheel can also be found here: https://wheelofnames.com/uyf-9ey"
                ]
            },
            {
                "name": "!subs",
                "responses": [
                    "Use this link to manage/gift Twitch subscriptions through a browser (mostly to avoid mobile fees) https://www.twitch.tv/subs/elite_spud. Change the username at the end to manage subs on other channels."
                ]
            },
            {
                "name": "!bits",
                "responses": [
                    "Use this link to purchase bits through a browser (mostly to avoid mobile fees) https://www.twitch.tv/bits."
                ]
            },
            {
                "name": "!raffle",
                "expiresAt": "2024-10-01T02:00:00",
                "responses": [
                    "At the end of the stream, I'll be pulling names out of a hat to determine who wins a $25 Steam gift card. You can enter by joining my Discord server and reacting to the relevant message in announcements https://discord.com/channels/1047198065808912436/1049378656511860836/1282854758238912604. If you donate at least $5 to BT1D and include your username, you'll receive an additional entry if you'd like."
                ]
            },
            {
                "name": "!tricky",
                "responses": [
                    "https://i.imgur.com/2MinFwu.png"
                ]
            },
            {
                "name": "!fanart",
                "responses": [
                    "Look at this awesome artwork that CaptainSnide drew!! https://bsky.app/profile/captainsnide.bsky.social/post/3lbg6zs7fs22j"
                ]
            }
        ]
    },
    {
        "commands": [
            {
                "name": "git gud",
                "responses": [
                    "git: 'gud' is not a git command. See 'git --help'"
                ]
            },
            {
                "name": "git --help",
                "responses": [
                    "usage: git [--help] <command> [<args>]     These are common Git commands used in various situations: add, google, pull, push, reset, status"
                ]
            },
            {
                "name": "git add",
                "strict": true,
                "responses": [
                    "Your name has been added to the list. The FBI will be in contact with you shortly.",
                    "2+2=4",
                    "One of the four basic operations of arithmetic, adding was first invented on November 10, 1969 when the educational children's television series, Sesame Street, premiered on the American television station, PBS.",
                    "Adding has been deprecated. From now on, we recommend subtracting negative values instead",
                    "Nothing specified, nothing added.    hint: Maybe you wanted to say 'git add .'?"
                ]
            },
            {
                "name": "git add .",
                "strict": true,
                "responses": [
                    "Your '.' has been received. We appreciate such generosity in these trying times."
                ]
            },
            {
                "name": "git google",
                "responses": [
                    "Step 1 of using git: google how to use git"
                ]
            },
            {
                "name": "git pull",
                "responses": [
                    "The gravity of Earth, denoted by g, is the net acceleration imparted to objects due to the combined effect of gravitational pull (from mass distribution within Earth) and the centrifugal force (from the Earth's rotation). Near the surface, the pull of Earth's gravity is approximately 9.81 meters per second per second.",
                    "pull (ˈpu̇l) v. 1: To exert force upon so as to cause or tend to cause motion toward the force    2: To extract    3: To draw the support or attraction of    [Middle English, from Old English pullian]"
                ]
            },
            {
                "name": "git push",
                "responses": [
                    "You extert as much force as you can, but nothing budges. It appears the chatbot is immovable."
                ]
            },
            {
                "name": "git reset",
                "responses": [
                    "Your progress has been reset, and your save file has been erased.",
                    "Manual override detected, Rebooting...",
                    "Resetting is impossible. There is no way out."
                ]
            }
        ]
    }
]