[
	{
		"timerMinutes": 120,
		"random": true,
		"commands": [
			{
				"name": "!twitter",
				"aliases": ["!tweets", "!twit"],
				"responses": [
					"Tweets go here when I'm live and sometimes when I'm not: https://twitter.com/ghetto_spud",
					"I'm a twit sometimes: https://twitter.com/ghetto_spud",
					"I tweet: https://twitter.com/ghetto_spud"
				]
			},
			{
				"name": "!youtube",
				"aliases": ["!vods", "!vod"],
				"responses": [
					"VODs get posted here (3x a week usually): https://www.youtube.com/channel/UCQZvvzMogGYW6oIBJKX1bxA",
					"Blind playthroughs and other interesting streams get archived on YouTube here: https://www.youtube.com/channel/UCQZvvzMogGYW6oIBJKX1bxA",
					"I archive most of my streams locally and post the good ones here: https://www.youtube.com/channel/UCQZvvzMogGYW6oIBJKX1bxA"
				]
			}
		]
	},
	{
		"timerMinutes": 120,
		"timerMinutesOffset": 60,
		"random": true,
		"commands": [
			{
				"name": "!music",
				"aliases": ["!lastfm", "!songs"],
				"responses": [
					"I collect music CDs and keep track of what I listen to as a hobby. You can judge my poor music taste here: https://www.last.fm/user/ghetto_spud",
					"I've been building up a small collection of music CDs for a few years. You can see what I have and what I've been listening to recently here: https://www.last.fm/user/ghetto_spud"
				]
			},
			{
				"name": "!av",
				"aliases": ["!setup", "!hardware"],
				"responses": [
					"Wanna know how many wires are in my AV setup? Or how many steps it takes to play GameBoy games on a PC monitor? Check the diagram here: https://gist.github.com/ghettospud/6f82f3da9d586df553757fa134278845 and the real life™ images here: https://twitter.com/ghetto_spud/status/1306375006008610817 Feel free to ask me questions about any specific components!",
					"Wondering what kind of hardware I use to stream/play console games? Take a look at this layout diagram: https://gist.github.com/ghettospud/6f82f3da9d586df553757fa134278845 to see how everything hooks together. You can also find images of everything in situ here: https://twitter.com/ghetto_spud/status/1306375006008610817 Don't be afraid to ask questions about how everything works!"
				]
			},
			{
				"name": "!games",
				"aliases": ["!history", "!opinions"],
				"responses": [
					"I maintain a list of all the games I've streamed (and might stream) here: https://docs.google.com/spreadsheets/d/1JsdDfmdjaL3d-oGsuq38z_jhrvkhePF1LLz4W1dpzI4/edit?usp=sharing and keep a tier list of my blind playthroughs here: https://pastebin.com/fRPKHM7D You can also check my pastebin profile for some of my more substantial opinions on certain games: https://pastebin.com/u/ghetto_spud"
				]
			},
			{
				"name": "!affiliate",
				"aliases": ["!luigi"],
				"responses": [
					"My incentive for reaching Twitch affiliate status is to beat Luigi's Mansion blindfolded. If that sounds like a disaster you'd like to spectate, you're in the right place!"
				]
			}
		]
	},
	{
		"commands": [
			{
				"name": "!pronouns",
				"responses": [
					"My preferred pronouns are they/she."
				]
			},
			{
				"name": "!foo",
				"responses": [
					"bar"
				]
			},
			{
				"name": "!tomato",
				"responses": [
					"tomahto"
				]
			},
			{
				"name": "!potato",
				"responses": [
					"potahto"
				]
			},
			{
				"name": "!blind",
				"aliases": ["!hints", "!nohints", "!help", "!mints", "!backseating", "!backseat", "!rhetorical"],
				"responses": [
					"Blind means that I know nothing about the game I'm playing and want to keep it that way. Assume all questions about the game are rhetorical, and don't hint/spoil/suggest/backseat/tip/advise/guide/recommend/remind/warn me in any way, please. I've played a lot of games, and I can learn how to walk on my own. You can always go play the game yourself if you can't keep it in your pants.",
					"Before you send a comment, consider if it might inform me about something I don't know or understand yet, hint that I'm doing something inefficiently, or otherwise imply that I've missed something in the game you think to be obvious, crucial, or interesting. I'm playing this game for my own enjoyment, and not knowing all the things is part of that experience. Let me be dumb, laugh with me when I fail, and rest assured that I'm not having less fun by skipping stuff."
				]
			},
			{
				"name": "!github",
				"aliases": ["!bot", "!chatbot", "!code", "!sourcecode"],
				"responses": [
					"I (Spud) wrote this chatbot myself because I'm a big nerd. If you fancy yourself a nerd too, you can peruse the source code on GitHub here: https://github.com/ghettospud/ghetto_botato",
					"This chatbot is © Spud Inc., which maintains an open policy of showcasing all the programming mistakes of the chatbot author for all to see here: https://github.com/ghettospud/ghetto_botato"
				]
			},
			{
				"name": "!commands",
				"responses": [
					"Available commands include: !commands    (note: list may be incomplete)"
				]
			},
			{
				"name": "!ta",
				"responses": [
					"To play Total Annihilation on Windows 10, I use a program called DXWND to run the game in a window that tricks the game into thinking it's fullscreen. My method for doing that is detailed here: https://pastebin.com/2jBtcvqt"
				]
			}
		]
	},
	{
		"commands": [
			{
				"name": "git gud",
				"responses": [
					"git: 'gud' is not a git command. See 'git --help'"
				]
			},
			{
				"name": "git --help",
				"responses": [
					"usage: git [--help] <command> [<args>]     These are common Git commands used in various situations: add, google, pull, push, reset, status"
				]
			},
			{
				"name": "git add",
				"strict": true,
				"responses": [
					"Your name has been added to the list. The FBI is now en route to your location.",
					"2+2=4",
					"One of the four basic operations of arithmetic, adding was first invented on November 10, 1969 when the educational children's television series, Sesame Street, premiered on the American television station, PBS.",
					"Adding has been deprecated. From now on, we recommend subtracting negative values instead",
					"Nothing specified, nothing added.    hint: Maybe you wanted to say 'git add .'?"
				]
			},
			{
				"name": "git add .",
				"strict": true,
				"responses": [
					"Your '.' has been received. We appreciate such generosity in these trying times."
				]
			},
			{
				"name": "git google",
				"responses": [
					"Step 1 of using git: google how to use git"
				]
			},
			{
				"name": "git pull",
				"responses": [
					"The gravity of Earth, denoted by g, is the net acceleration imparted to objects due to the combined effect of gravitational pull (from mass distribution within Earth) and the centrifugal force (from the Earth's rotation). Near the surface, the pull of Earth's gravity is approximately 9.81 meters per second per second.",
					"pull (ˈpu̇l) v. 1: To exert force upon so as to cause or tend to cause motion toward the force    2: To extract    3: To draw the support or attraction of [Middle English, from Old English pullian]"
				]
			},
			{
				"name": "git push",
				"responses": [
					"Hey, don't shove me!",
					"You extert as much force as you can, but nothing budges. It appears the chatbot is immovable"
				]
			},
			{
				"name": "git reset",
				"responses": [
					"Your progress has been reset, and your save file has been erased.",
					"Manual override detected, Rebooting...",
					"Resetting is impossible. There is no way out."
				]
			}
		]
	}
]